In [6]:
import pandas as pd
secondary_raw=pd.read_csv("../data/secondary.csv")
secondary_raw.head()

,Reference Area,Time Period,Sex,Age group,Units of measurement,Observation Value
0,Afghanistan,2014,All genders,Not applicable,Number,2602734.0
1,Afghanistan,2014,Female,Not applicable,Number,901106.0
2,Afghanistan,2013,Female,Not applicable,Number,874199.0
3,Afghanistan,2013,All genders,Not applicable,Number,2538420.0
4,Afghanistan,2012,All genders,Not applicable,Number,2415884.0

In [11]:
print(secondary_raw.shape)
print(secondary_raw.columns)
secondary_raw.info()

(12876, 6)
Index(['Reference Area', 'Time Period', 'Sex', 'Age group',
       'Units of measurement', 'Observation Value'],
      dtype='object')
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 12876 entries, 0 to 12875
Data columns (total 6 columns):
 #   Column                Non-Null Count  Dtype
---  ------                --------------  -----
 0   Reference Area        12876 non-null  object
 1   Time Period           12876 non-null  int64
 2   Sex                   12876 non-null  object
 3   Age group             12876 non-null  object
 4   Units of measurement  12876 non-null  object
 5   Observation Value     12876 non-null  float64
dtypes: float64(1), int64(1), object(4)
memory usage: 603.7+ KB

In [14]:
secondary = secondary_raw.copy()
secondary=secondary.rename(columns={"Reference Area": "Country","Time Period":"Year","Observation Value":"Value"})
secondary.head()

,Country,Year,Sex,Age group,Units of measurement,Value
0,Afghanistan,2014,All genders,Not applicable,Number,2602734.0
1,Afghanistan,2014,Female,Not applicable,Number,901106.0
2,Afghanistan,2013,Female,Not applicable,Number,874199.0
3,Afghanistan,2013,All genders,Not applicable,Number,2538420.0
4,Afghanistan,2012,All genders,Not applicable,Number,2415884.0

In [15]:


# filter to all genders
secondary = secondary[secondary["Sex"] == "All genders"].copy()  

# drop columns that are no longer needed
secondary = secondary.drop(columns=["Sex", "Age group", "Units of measurement"])

# convert types
secondary["Year"] = pd.to_numeric(secondary["Year"], errors="coerce")
secondary["Value"] = pd.to_numeric(secondary["Value"], errors="coerce")

# drop missing
secondary = secondary.dropna(subset=["Country", "Year", "Value"]).copy()
secondary["Year"] = secondary["Year"].astype(int)

# clean country text
secondary["Country"] = secondary["Country"].astype(str).str.strip()

# rename value
secondary = secondary.rename(columns={"Value": "Enroll_Secondary"})

In [16]:
secondary.head()

       Country  Year  Enroll_Secondary
0  Afghanistan  2014         2602734.0
3  Afghanistan  2013         2538420.0
4  Afghanistan  2012         2415884.0
7  Afghanistan  2011         2208963.0
8  Afghanistan  2010         2044157.0

In [17]:
#ceheckin  the max and min
print(secondary["Year"].min(),secondary["Year"].max())
print("Duplicate Country-Year pairs:",secondary.duplicated(subset=["Country","Year"]).sum())

1975 2015
Duplicate Country-Year pairs: 0

In [18]:
secondary.to_csv("../output/secondary_clean.csv", index=False)